#+STARTUP: content

* Emacs Appearance configuration

** Themes
*** Zenburn                                                        :DISABLED:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/zenburn-emacs" user-emacs-directory))
#+END_SRC

*** Dracula                                                        :DISABLED:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/dracula" user-emacs-directory))
#+END_SRC

*** Sirthias                                                       :DISABLED:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/sirthias" user-emacs-directory))
#+END_SRC 

*** Solarised                                                      :DISABLED:
Solarised theme configuration, guess the most optimal values for me, though still don't really like this theme:    
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/solarized-emacs" user-emacs-directory))
  (setq solarized-contrast                   'high
        solarized-visibility                 'high
        solarized-termcolors                  256
        solarized-distinct-fringe-background  t
        solarized-use-variable-pitch          nil
        solarized-use-less-bold               nil
        solarized-use-more-italic             nil
        solarized-high-contrast-mode-line     t
        solarized-emphasize-indicators        t
        x-underline-at-descent-line           t)
#+END_SRC

*** Monokai                                                        :DISABLED:
#+BEGIN_SRC emacs-lisp :results none
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/monokai-emacs" user-emacs-directory))
#+END_SRC
*** Spacemacs                                                       :CURRENT:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (expand-file-name "platform/appearance/themes/spacemacs" user-emacs-directory))
#+END_SRC

*** General themes' settings
#+BEGIN_SRC emacs-lisp
  (require 'spacemacs-light-theme)
  (load-theme 'spacemacs-light t t)
#+END_SRC

#+RESULTS:
: t

** Fonts
*** Definitions
#+BEGIN_SRC emacs-lisp :results none
  (defcustom default-font-name "PragmataPro"
    "Font name used by default"
    :group 'string 
    :options '("PragmataPro"
               "Hack"
               "Ayuthaya"))

  (defcustom default-font-size 18
    "Default Font size used across all frames")

  (defun change-font-size (value)
    (interactive
     (list
      (read-number (format "Font current font size [%d] to: " font-size))))
    (setq font-size value)
    (4lex1v:gui:font font-name :size value))
#+END_SRC

*** Loading Font properties
Loading font configuration:
#+BEGIN_SRC emacs-lisp
  (load "fonts/pretty-pragmata")
  (load "fonts")

  (let ((frame-font (format "%s-%d"
                            default-font-name
                            default-font-size)))
    (set-frame-font frame-font)
    (add-to-list 'default-frame-alist (cons 'font frame-font)))
#+END_SRC

#+RESULTS:
: ((font . PragmataPro-18) (alpha 100 . 100) (fullscreen . maximized) (font . PragmataPro-16) (vertical-scroll-bars))
  
** General
   The rest:
   #+BEGIN_SRC emacs-lisp :results none
      (4lex1v:gui:frame :size         'maximized
                       :transparency '(100 . 100)
                       :cursor       '(box . bar))
   #+END_SRC
